Ran Plan for dir: `s3` workspace: `default`

<details><summary>Show Output</summary>

```diff
>>>>>>>>>>>>>>>>>>>>>>>>>>>>> Running plan for project  at dir /home/atlantis/.atlantis/repos/amazondevops/checkov/1/default/s3


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.checkov will be created
  + resource "aws_s3_bucket" "checkov" {
      + acceleration_status         = (known after apply)
      + acl                         = "public-read"
      + arn                         = (known after apply)
      + bucket                      = "checkov-test"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment"       = "dev"
          + "Name"              = "checkov-test"
          + "Scope"             = "PCI"
          + "product_v2"        = "dev"
          + "terraform_managed" = "true"
        }
      + tags_all                    = {
          + "Environment"       = "dev"
          + "Name"              = "checkov-test"
          + "Scope"             = "PCI"
          + "product_v2"        = "dev"
          + "terraform_managed" = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket.my_bucket will be created
  + resource "aws_s3_bucket" "my_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "public-read"
      + arn                         = (known after apply)
      + bucket                      = "checkov"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment"       = "dev"
          + "Name"              = "checkov"
          + "Scope"             = "PCI"
          + "product_v2"        = "dev"
          + "terraform_managed" = "true"
        }
      + tags_all                    = {
          + "Environment"       = "dev"
          + "Name"              = "checkov"
          + "Scope"             = "PCI"
          + "product_v2"        = "dev"
          + "terraform_managed" = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket.test will be created
  + resource "aws_s3_bucket" "test" {
      + acceleration_status         = (known after apply)
      + acl                         = "public-read"
      + arn                         = (known after apply)
      + bucket                      = "Test"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
          + "Name"        = "Test"
          + "Scope"       = "PCI"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "Name"        = "Test"
          + "Scope"       = "PCI"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + bucket_arn = (known after apply)
╷
│ Warning: Argument is deprecated
│ 
│   with aws_s3_bucket.my_bucket,
│   on main.tf line 7, in resource "aws_s3_bucket" "my_bucket":
│    7:   acl    = "public-read" 
│ 
│ Use the aws_s3_bucket_acl resource instead
│ 
│ (and 5 more similar warnings elsewhere)
╵

─────────────────────────────────────────────────────────────────────────────

Saved the plan to:
/home/atlantis/.atlantis/repos/amazondevops/checkov/1/default/s3/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/atlantis/.atlantis/repos/amazondevops/checkov/1/default/s3/default.tfplan"

>>>>>>>>>>>>>>>>>>>>>>>>>>>>> Runned plan for project  at dir /home/atlantis/.atlantis/repos/amazondevops/checkov/1/default/s3
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d s3`
* :put_litter_in_its_place: To **delete** this plan click [here](http://1fc1fcf4ef1f:4141/lock?id=amazondevops%252Fcheckov%252Fs3%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d s3`
</details>
Plan: 3 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`